---
kind: method
id: M:Autodesk.Revit.DB.DividedPath.GetIntersectingElements
source: html/fbdf6393-21be-362e-4033-56b62b2aff2c.htm
---
# Autodesk.Revit.DB.DividedPath.GetIntersectingElements Method

Get the elements whose intersection with path produces points.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetIntersectingElements()
```